In [7]:
# It allows to group together rows based off a column and perform some aggregate function on them

In [8]:
import numpy as np
import pandas as pd

In [4]:
data = {'Company':['TCS','TCS','INFY','INFY','GOOG','GOOG'],
        'Person':['Apoorv', 'Ptk', 'David', 'Jeff', 'Sundar', 'Daniella'],
        'Sales':[140, 610, 120, 511, 125, 634]}

In [6]:
data

{'Company': ['TCS', 'TCS', 'INFY', 'INFY', 'GOOG', 'GOOG'],
 'Person': ['Apoorv', 'Ptk', 'David', 'Jeff', 'Sundar', 'Daniella'],
 'Sales': [140, 610, 120, 511, 125, 634]}

In [10]:
df = pd.DataFrame(data)
df

  Company    Person  Sales
0     TCS    Apoorv    140
1     TCS       Ptk    610
2    INFY     David    120
3    INFY      Jeff    511
4    GOOG    Sundar    125
5    GOOG  Daniella    634

In [11]:
df.groupby('Company')

In [12]:
byComp = df.groupby('Company')

In [13]:
byComp.mean()

         Sales
Company
GOOG     379.5
INFY     315.5
TCS      375.0

In [14]:
byComp.sum()

         Sales
Company
GOOG       759
INFY       631
TCS        750

In [15]:
byComp.std()

              Sales
Company
GOOG     359.917352
INFY     276.478751
TCS      332.340187

In [16]:
byComp.sum().loc['TCS']

Sales    750
Name: TCS, dtype: int64

In [18]:
df.groupby('Company').sum().loc['GOOG']

Sales    759
Name: GOOG, dtype: int64

In [19]:
df.groupby('Company').count()

         Person  Sales
Company
GOOG          2      2
INFY          2      2
TCS           2      2

In [20]:
df.groupby('Company').max()

         Person  Sales
Company
GOOG     Sundar    634
INFY       Jeff    511
TCS         Ptk    610

In [21]:
df.groupby('Person').max()

         Company  Sales
Person
Apoorv       TCS    140
Daniella    GOOG    634
David       INFY    120
Jeff        INFY    511
Ptk          TCS    610
Sundar      GOOG    125

In [23]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
GOOG      2.0  379.5  359.917352  125.0  252.25  379.5  506.75  634.0
INFY      2.0  315.5  276.478751  120.0  217.75  315.5  413.25  511.0
TCS       2.0  375.0  332.340187  140.0  257.50  375.0  492.50  610.0

In [24]:
df.groupby('Company').describe().transpose()

Company            GOOG        INFY         TCS
Sales count    2.000000    2.000000    2.000000
      mean   379.500000  315.500000  375.000000
      std    359.917352  276.478751  332.340187
      min    125.000000  120.000000  140.000000
      25%    252.250000  217.750000  257.500000
      50%    379.500000  315.500000  375.000000
      75%    506.750000  413.250000  492.500000
      max    634.000000  511.000000  610.000000

In [25]:
df.groupby('Company').describe().transpose()['TCS']

Sales  count      2.000000
       mean     375.000000
       std      332.340187
       min      140.000000
       25%      257.500000
       50%      375.000000
       75%      492.500000
       max      610.000000
Name: TCS, dtype: float64